app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT COUNT(*) FROM "tasks"
---
          <span class="ml-1.5 text-xs px-1.5 py-0.5 rounded-full <%= params[:filter].blank? ? 'bg-terracotta/10 text-terracotta dark:bg-terracotta/20 dark:text-terracotta-light' : 'bg-stone-200 dark:bg-slate-600 text-stone-500 dark:text-slate-400' %>">
            <%= Task.count %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."completed" = FALSE ORDER BY "tasks"."created_at" DESC
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."completed" = TRUE
---
          <span class="ml-1.5 text-xs px-1.5 py-0.5 rounded-full <%= params[:filter] == 'completed' ? 'bg-sage/20 text-sage-dark dark:bg-sage/30 dark:text-sage-light' : 'bg-stone-200 dark:bg-slate-600 text-stone-500 dark:text-slate-400' %>">
            <%= Task.completed.count %>