app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
---
  def index
    @tasks = Task.all

INSERT INTO "tasks" ("completed", "created_at", "description", "due_date", "priority", "title", "updated_at") VALUES (FALSE, '2025-12-11 16:37:25.775687', 'You need to do this task now', '2025-12-18', 3, 'A new task that you need to do', '2025-12-11 16:37:25.775687') RETURNING "id"
---
  def create
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "completed" = TRUE, "updated_at" = '2025-12-11 16:37:45.483743' WHERE "tasks"."id" = 8
---
  def toggle_complete
    @task.update(completed: !@task.completed)